In [43]:
import mod_sql as ms
import imp
imp.reload(ms)

In [38]:
test = ms.Database('localhost', 'root', '0630', 'ubion7' ,3306)

In [39]:
sql = """
    select
    *
    from
    user_info
"""

test.func_3(sql)

  user_id user_pass user_name   user_phone  user_gender
0    test      1111      test  01012345678            1
1   test2      1234     test2  01011112222            1
2   test3      1234     test3  01011118888            1
3   test4      2222     test4  01022229999            1
4   test5      5555     test5  01077779999            1
5   test6      6666     test6  01077777777            1
6   test7      7777     test7  01078879999            1

In [44]:
test2 = ms.Database('172.16.11.148', 'ubion', '1234', 'ubion7' ,3306) # 강사님꺼

In [46]:
sql = """
    select
    *
    from
    user_info
"""

test2.func_3(sql)

Empty DataFrame
Columns: []
Index: []

In [42]:
sql = """
    insert into
    user_info
    values
    (%s, %s, %s, %s, %s)
"""

values= ["sejin", "0617", "sejin", "01088218821" , 2]

test2.func_3(sql,values)

AttributeError: 'Database' object has no attribute '_db'

In [27]:
sql = """
    select
    Name, Phone
    from
    example
    where
    Gender = 'male'
"""

test.func_3(sql)

  Name          Phone
0    A  010-1234-5678
1    C  010-1234-5680
2    E  010-1234-5682
3    G  010-1234-5684
4    I  010-1234-5686

In [36]:
sql = """
    select
    `Name` as '이름',
    `Phone` as '휴대폰번호'
    from
    example
    where
    Gender = %s
    limit 3
"""
#컬럼에는 ``로 묶는게 좋다고 하심

values = ['female']
test.func_3(sql,values)

  이름          휴대폰번호
0  B  010-1234-5679
1  D  010-1234-5681
2  F  010-1234-5683